Revit 2015 API
RebarBarTypeSet Properties
The RebarBarTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Size
Returns the number of RebarBar types that are in the set.
See Also
RebarBarTypeSet Class
Autodesk.Revit.DB.Structure Namespace